#!/usr/bin/env python3
# -*- coding:utf-8 -*-

#請各組於 12/6(日) 午夜前上傳一個 Python 題目至 Github 課程專案內。
#檔名為 Assignment_TeamXX_HW05.py 其中 XX 為你們的組別編號。
#e.g., 第 3 組同學，請上傳 Assignment_Team03_HW05.py 每組上傳一個檔案即可。

#題目可自由發揮，內容亦不限計概。您可以代入其他必修課程中需要運算的部份做為程式計算的步驟，但務必以清楚文字描述。
#參考題型：http://www.ling.gu.se/~lager/python_exercises.html
#若要從前述網頁中出題，1 ~ 16 題因為太簡單，不可列在其中。

猜數字遊戲

參賽者2~5人,先各自輸入名字,電腦隨機擇一範圍在1~36內的數字,並隨機擇一玩家可知曉該數字,開始遊戲.
各玩家按順序喊+1~+3,除知曉數字的人以外各玩家可使用功能牌:pass or return一次,持續到有一玩家喊到或經過設定的數字者為輸.可重複遊戲.
需該回合玩家知道她可輸入得指令 e.x: 玩家___,你可輸入數字1~3 or pass or return