#!/usr/bin/env python3
# -*- coding:utf-8 -*-

def bin2int(n):
    a=1
    an=0
    while n > 0:
        r=n%10
        if r > 0:
            an += a
        a *= 2
        n=(n-r)/10
    return an
if __name__ == '__main__':

    n = 1111
    bin2int(n)
    print(bin2int(n))
    #你可以用一個變數承接 bin2int() 的回傳值，然後再印出那個變數即可。這麼一來，可以避免讓電腦把同一件事「算兩次」。像這樣：
    #x = bin2int(n)
    #print(x)




#P2-19a=10
#P2-19b=17
#P2-19c=6
#P2-19d=8
#P2-20a=14
#P2-20b=8
#P2-20c=13
#P2-20d=4
#P2-22a=00010001 11101010 00100010 00001110
#P2-22b=00001110 00111000 11101010 00111000
#P2-22c=01101110 00001110 00111000 01001110
#P2-22d=00011000 00111000 00001101 00001011
#P3-28a=234
#P3-28b=560
#P3-28c=874
#P3-28d=888
#P3-30a=234
#P3-30b=560
#P3-30c=875
#P3-30d=889





