#!/usr/bin/env python3
# -*- coding:utf-8 -*-

#Python 程式的前兩行是固定的，不能有其它的東西佔到這兩行，請牢記。
#缺了第一題！

#我建議你使用一個 IDE 來編寫程式原始碼。你的程式裡的中文在我這裡看起來是一片亂碼！
#作業2.  Ch2. P2.19
    #a. 10
    #b. 17
    #c. 6
    #d. 8

#作業3.  Ch2. P2.20
    #a. 14
    #b. 8
    #c. 13
    #d. 4

#作業4.  Ch2. P2.22
    #a. 00010001 11101010 00100010 00001110
    #b. 00001110 00111000 11101010 00111000
    #c. 01101110 00001110 00111000 01001110
    #d. 00011000 00111000 00001101 00001011

#作業5.  Ch3. P3.28
    #a. 234
    #b. 560
    #c. 874
    #d. 888

#作業6.  Ch3. P3.30
    #a. 234
    #b. 560
    #c. 875
    #d. 889