#!/usr/bin/env python3
# -*- coding:utf-8 -*-

#Python 程式的前兩行是固定的，不能有其它的東西佔到這兩行，請牢記。

def bin2dec(n):
     Ans=int(n, 2)
     #print("{} is what you want.".format(Ans))
     print("{0} is what you want.".format(Ans))
     #大括號裡要加上數字，如果有多個要代換的值，從 0 開始依續往下編。{0}...{1}...{2}... 等
     #Python 的縮排，每次四個空格。這個數字不要亂換。

if __name__ == '__main__':
    n = "01100101"

    bin2dec(n)











#p2-19a=10
#p2-19b=17
#p2-19c=6
#p2-19d=8
#p2-20a=14
#p2-20b=8
#p2-20c=14 #錯
#p2-20d=4
#p2-22a=00010001 11101010 00100010 00001110
#p2-22b=00001110 00111000 11101010 00111000
#p2-22c=01101110 00001110 00111000 01001110
#p2-22d=00011000 00111000 00001101 00001011
#p3-28a=234
#p3-28b=560
#p3-28c=874
#p3-28d=888
#p3-30a=234
#p3-30b=560
#p3-30c=875
#p3-30d=889