#第一題是不是這樣打ㄚ，會的人教一下，by jeffntu
if __name__ == '__main__':
    n = 0
    p = raw_input('input a bin number:\n')
    for i in range(len(p)):
        n = n * 2 + ord(p[i]) - ord('0')
    print n








#2-19   a.10  b.17  c.6  d.8
#2-20   a.14  b.8  c.13  d.4
#2-22   a. 00010001  11101010  00100010  00001110  b. 00001110  00111000  11101010  00111000  c.01101110  00001110  00111000  01001110  d.00011000  00111000  00001101  00001011
#3-28   a.234  b.560  c.874  d.888
#3-30   a.234  b.560  c.875  d.889