test



#我實在不知道該如何寫，就胡亂試寫啦


>>>print "Hello World"

#把二進制的數字轉為十進制

def mine:       #這是我的自創程式
    if N == 0:               
        return 0           #二進制為零，十進制也為零
    my_list =[]
    while N>0
    a = bit (N % 2)
    len (a)               
    j=len(a)                  
    for c in my_list[::-1]
    my_list.append(c)    #第幾位的數，便乘以2的幾次方
    
   ans = sum my_list.append(c) #全部相加
    print ans                  #輸出答案
 
    
    if __name__ == '__main__':
        intNumber = 100
        int2bin(intNumber)
    
        binNumber = "01100101"
        #bin2int(number)              
        
       
       
       
       
       
       
       
       
       
       
       
        # 課本p2.2.19a=  
            10
        # 課本p2.2.19b=  
            17
        # 課本p2.2.19c=  
            6
        # 課本p2.2.19d=  
            8
        # 課本p2.2.20a=   
        14
        # 課本p2.2.20b=  
            8
        # 課本p2.2.20c=  
            13
        # 課本p2.2.20d=  
            4
        # 課本p2.3.22a= 
            00010001  11101010  00100010  00001110
        # 課本p2.3.22b=  
        00001110  00111000  11101010  00111000
        # 課本p2.3.22c=  
        01101110  00001110  00111000  01001110
        # 課本p2.3.22d= 
            00011000  00111000  00001101  00001011
        # 課本p3.3.28a=  
            234
        # 課本p3.3.28b=  
            560
        # 課本p3.3.28c=  
            874
        # 課本p3.3.28d=  
            888
        # 課本p3.3.30a=  
            234
        # 課本p3.3.30b=  
            560
        # 課本p3.3.30c=  
            875
        # 課本p3.3.30d=  
            889        
