#!/usr/bin/env python3
# -*- coding:utf-8 -*-


    #作業 1.
    # 請參考上例，自己寫一個將二進位表示數轉為十進位制的函式：
   
    
        int a=1 
        int b=0
        input(int2bin(x))
        while (x>0):
            b+=(x%10)*a
            a*=2
            x/=10
            
        print b    

#作業 2. 課本 Ch2. P2.19
#a.= 10
#b.= 17
#c.= 6
#d.= 8
#作業 3. 課本 Ch2. P2.20
#a.= 14
#b.= 8
#c.= 13
#d.= 4
#作業 4. 課本 Ch2. P2.22
#a.= 00010001 11101010 00100010 00001110
#b.= 00001110 00111000 11101010 00111000
#c.= 01101110 00001110 00111000 01001110
#d.= 00011000 00111000 00001101 00001011
#作業 5. 課本 Ch3. P3.28
# a.= 234
#b.= 560
#c.= 874
#d.= 888
#作業 6. 課本 Ch3. P3.30
# a.= 234
#b.= 560
#c.= 875
#d.= 889


